import React from 'react';
import { Link } from 'react-router-dom'; 

import { CarouselComp } from './CarouselEco';

const Eco = () => {


return (
    <div className='bg-bluegray-100 min-h-screen flex justify-center items-center'>
        <div className='max-w-screen-xl mx-auto p-6'>
        <h2 className="text-4xl text-center mb-6 text-black font-semibold">Οικοδέσποινα, γραφείο αγροτουρισμού και υπαίθριων δραστηριοτήτων</h2>
        <div className="text-xl text-center mb-6 text-black">
            Το γραφείο οικοτουρισμού στον Βουτσαρά Ιωαννίνων αποτελεί έναν παράδεισο περιπέτειας για μικρούς εξερευνητές. Με εξειδικευμένες δραστηριότητες που σχεδιάστηκαν ειδικά για παιδιά, ανοίγει τον δρόμο για μοναδικές εμπειρίες.

                    Το rafting αποτελεί μια συναρπαστική περιπέτεια στα κρύα νερά του ποταμού, δίνοντας την ευκαιρία στους νεαρούς ταξιδιώτες να ανακαλύψουν την ομορφιά της φύσης. Πεζοπορία σε μονοπάτια που οδηγούν σε εντυπωσιακά τοπία ενθαρρύνει την ενασχόληση με το φυσικό περιβάλλον.

                Το κυνήγι θησαυρού αποτελεί ένα διασκεδαστικό παιχνίδι που προάγει τη συνεργασία, ενώ οι μικροί θησαυροί ανακαλύπτονται σε κρυμμένα μέρη, αναδεικνύοντας την παιχνιδιάρικη πλευρά της περιπέτειας.

                Επιπλέον, το γραφείο προσφέρει pool parties, προσφέροντας στα παιδιά μια ασφαλή και διασκεδαστική εμπειρία κολύμβησης και παιχνιδιού. Με εξειδικευμένο προσωπικό που είναι επαγγελματίες στον τομέα του τουρισμού και της παιδείας, το γραφείο εξασφαλίζει την ασφάλεια και την αξιομνημόνευτη εμπειρία για τους μικρούς επισκέπτες. Έτσι, το γραφείο οικοτουρισμού στον Βουτσαρά αναδεικνύεται ως ο καλύτερος προορισμός για οικογένειες που αναζητούν μοναδικές περιπέτειες γεμάτες εκπλήξεις για τα παιδιά τους.
        </div>
        <div className="flex justify-center"> 
            <CarouselComp />
        </div>
        </div>
        <div className="absolute top-0 right-0 mt-2 mr-2">
            <Link to="/" className="bg-blue-gray-500 hover:bg-blue-gray-800 text-white font-bold py-2 px-4 rounded">
                Αρχική
            </Link>
        </div>
    </div>
);
};

export default Eco;






